coconut/app/models/seat.rb

  def validate_booking_capacity
    if flight.seats.size >= flight.capacity
---
SELECT COUNT(*) FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 3]]