workout_app/app/controllers/client_workouts_controller.rb

SELECT "client_workouts".* FROM "client_workouts"
---
  def index
    @client_workouts = ClientWorkout.all

SELECT "client_workouts".* FROM "client_workouts" WHERE ("client_workouts"."client_name" = ? OR "client_workouts"."trainer" = ?)  [["client_name", "Lenny Goldberg"], ["trainer", "Lenny Goldberg"]]
---
  def find
    #@client_workouts = ClientWorkout.where(client_name: params[:search_string])
    #  .or(ClientWorkout.where(trainer: params[:search_string]))
    search = params[:search_string]
    @client_workouts = ClientWorkout.where("client_name = ? OR trainer = ?", search, search)

DELETE FROM "client_workouts" WHERE "client_workouts"."id" = ?  [["id", 7]]
---
  def destroy
    @client_workout.destroy

SELECT "client_workouts".* FROM "client_workouts" WHERE "client_workouts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_client_workout
      @client_workout = ClientWorkout.find(params[:id])