coconut/app/controllers/seats_controller.rb

SELECT "seats".* FROM "seats"
---
  def index
    @seats = Seat.all

INSERT INTO "seats" ("flight_id", "name", "baggage", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["flight_id", 1], ["name", "Brad Sturgieon"], ["baggage", 22.0], ["created_at", "2023-12-03 13:29:29.743308"], ["updated_at", "2023-12-03 13:29:29.743308"]]
---
  def create
    @seat = Seat.new(seat_params)

    respond_to do |format|
      if @seat.save

UPDATE "seats" SET "flight_id" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["flight_id", 1], ["updated_at", "2023-12-04 01:55:37.795082"], ["id", 30]]
---
  def update
    flight_id = @seat.flight_id
    respond_to do |format|
      if @seat.update(seat_params)

DELETE FROM "seats" WHERE "seats"."id" = ?  [["id", 30]]
---
  def destroy
    flight_id = @seat.flight_id
    @seat.destroy

SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def flight_seats
    @flight = Flight.find(params[:flight_id])

SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
---
    def set_seat
      @seat = Seat.find(params[:id])